recursos/xml/ReqConsultarUsuariosPorFiltro.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.davivienda.com/Empresarial/SrvScnUsuario/v1" xmlns:v11="http://www.davivienda.com/Esquemas/Framework/ContextoSolicitudTipo/v1" xmlns:v12="http://www.davivienda.com/Esquemas/Framework/ServicioTipo/v1" xmlns:v13="http://www.davivienda.com/Esquemas/Framework/OperacionCanalTipo/v1" xmlns:v14="http://www.davivienda.com/Esquemas/Framework/ConsumidorTipo/v1" xmlns:v15="http://www.davivienda.com/Esquemas/Framework/AplicacionTipo/v1" xmlns:v16="http://www.davivienda.com/Esquemas/Framework/CanalTipo/v1" xmlns:v17="http://www.davivienda.com/Esquemas/Framework/TerminalTipo/v1" xmlns:v18="http://www.davivienda.com/Esquemas/Framework/HuellaDigitalDispositivoTipo/v1" xmlns:v19="http://www.davivienda.com/Esquemas/Framework/CriterioOrdenamientoTipo/v1" xmlns:v110="http://www.davivienda.com/Esquemas/Framework/PaginacionTipo/v1" xmlns:v111="http://www.davivienda.com/Esquemas/Framework/TelefonoTipo/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:msjSolOpConsultarUsuariosPorFiltro>
         <v1:contextoSolicitud>
            <v11:servicio>
               <v12:idServicio>?</v12:idServicio>
               <v12:versionServicio>?</v12:versionServicio>
            </v11:servicio>
            <v11:operacionCanal>
               <v13:idSesion>?</v13:idSesion>
               <v13:idTransaccion>?</v13:idTransaccion>
               <v13:fecOperacion>?</v13:fecOperacion>
               <v13:valJornada>?</v13:valJornada>
               <v13:codMoneda>?</v13:codMoneda>
               <v13:codPais>?</v13:codPais>
               <v13:codIdioma>?</v13:codIdioma>
            </v11:operacionCanal>
            <v11:consumidor>
               <v14:idConsumidor>?</v14:idConsumidor>
               <v14:aplicacion>
                  <v15:idAplicacion>?</v15:idAplicacion>
               </v14:aplicacion>
               <v14:canal>
                  <v16:idCanal>?</v16:idCanal>
                  <v16:idHost>?</v16:idHost>
               </v14:canal>
               <v14:terminal>
                  <v17:idTerminal>?</v17:idTerminal>
                  <v17:valOrigenPeticion>?</v17:valOrigenPeticion>
                  <v17:codUsuario>?</v17:codUsuario>
                  <v17:valPerfil>?</v17:valPerfil>
               </v14:terminal>
            </v11:consumidor>
            <!--Optional:-->
            <v11:huellaDigitalDispositivo>
               <!--Optional:-->
               <v18:idBeacon>?</v18:idBeacon>
               <!--Optional:-->
               <v18:valHuellaDispositivo>?</v18:valHuellaDispositivo>
               <!--Optional:-->
               <v18:valTokenCookie>?</v18:valTokenCookie>
               <!--Optional:-->
               <v18:valTokenFSO>?</v18:valTokenFSO>
               <!--Optional:-->
               <v18:valHttpAccept>?</v18:valHttpAccept>
               <!--Optional:-->
               <v18:valHttpAcceptChars>?</v18:valHttpAcceptChars>
               <!--Optional:-->
               <v18:valHttpAcceptEncoding>?</v18:valHttpAcceptEncoding>
               <!--Optional:-->
               <v18:valHttpAcceptLanguage>?</v18:valHttpAcceptLanguage>
               <!--Optional:-->
               <v18:valHttpReferrer>?</v18:valHttpReferrer>
               <!--Optional:-->
               <v18:valIpAddress>?</v18:valIpAddress>
               <!--Optional:-->
               <v18:valUserAgent>?</v18:valUserAgent>
            </v11:huellaDigitalDispositivo>
            <v11:criteriosOrdenamiento>
               <!--Zero or more repetitions:-->
               <v11:criterioOrdenamiento>
                  <!--Optional:-->
                  <v19:valColumna>?</v19:valColumna>
                  <!--Optional:-->
                  <v19:valOrden>?</v19:valOrden>
               </v11:criterioOrdenamiento>
            </v11:criteriosOrdenamiento>
            <!--Optional:-->
            <v11:paginacion>
               <!--Optional:-->
               <v110:valCantidadRegistrosLote>?</v110:valCantidadRegistrosLote>
               <!--Optional:-->
               <v110:valNumeroLote>?</v110:valNumeroLote>
               <!--Optional:-->
               <v110:valTotalRegistros>?</v110:valTotalRegistros>
            </v11:paginacion>
         </v1:contextoSolicitud>
         <!--Optional:-->
         <v1:codTipoIdentificacion>?</v1:codTipoIdentificacion>
         <!--Optional:-->
         <v1:valNumeroIdentificacion>?</v1:valNumeroIdentificacion>
         <!--Optional:-->
         <v1:codEmpresaAsociada>?</v1:codEmpresaAsociada>
         <!--Optional:-->
         <v1:valNombres>?</v1:valNombres>
         <!--Optional:-->
         <v1:valApellidos>?</v1:valApellidos>
         <!--Optional:-->
         <v1:valCorreoElectronico>?</v1:valCorreoElectronico>
         <!--Optional:-->
         <v1:valTipoUsuario>?</v1:valTipoUsuario>
         <!--Optional:-->
         <v1:valTipoAutenticacion>?</v1:valTipoAutenticacion>
         <!--Optional:-->
         <v1:valEstadoClave>?</v1:valEstadoClave>
         <!--Optional:-->
         <v1:valDireccion>?</v1:valDireccion>
         <!--Optional:-->
         <v1:valTelefono>
            <v111:codTipoTelefono>?</v111:codTipoTelefono>
            <v111:valNumeroTelefono>?</v111:valNumeroTelefono>
         </v1:valTelefono>
         <!--Optional:-->
         <v1:esNotificarCcvAlCorreo>?</v1:esNotificarCcvAlCorreo>
         <!--Optional:-->
         <v1:valTipoToken>?</v1:valTipoToken>
         <!--Optional:-->
         <v1:valPaisOrigen>?</v1:valPaisOrigen>
      </v1:msjSolOpConsultarUsuariosPorFiltro>
   </soapenv:Body>
</soapenv:Envelope>